# Вывести последнюю букву в слове
word = 'Архангельск'
print(word[-1])


# Вывести количество букв "а" в слове
word = 'Архангельск'
print(len(word))


# Вывести количество гласных букв в слове
word = 'Архангельск'
for w in word:
    

[а] [у] [о] [и] [э] [ы]


# Вывести количество слов в предложении
sentence = 'Мы приехали в гости'
print(len(sentence.split()))


# Вывести первую букву каждого слова на отдельной строке
sentence = 'Мы приехали в гости'
print('М \nп\nв\nг')


# Вывести усреднённую длину слова в предложении
sentence = 'Мы приехали в гости'
print(sentence)